<!DOCTYPE html>
<html lang="en" xml:lang="en">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
      <title>
                    
                    Databaser och tidskrifter
                </title>
      <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
      <link rel="stylesheet" href="assets/css/main.css">
      <link rel="stylesheet" href="assets/css/desktop.css">
   </head>
   <body>
      <header>
         <h1>Databaser och tidskrifter</h1>
      </header>
      <nav id="sitenav"><a href="index.html">Hem</a> |
         <a href="bibliographic.html">Bibliografiska poster</a> |
         <a href="databasetypes.html">Databastyper</a> |
         <a href="search.html">Sökspråk</a> |
         <a href="libris.html" style="font-size : 0.9em">(Libris Sökspråk)</a> |
         <a href="strategies.html">Sökstrategier</a>
      </nav>
      <main id="manuscript">
         
            <div class="container"><div class="row">
               <div class="col-md">
                  <article class="transcription">
                     
                     
                     <p><span class="def">En databas definieras enligt Svensk ordbok (SO) som en: "st&ouml;rre samling upp&shy;gifter som finns lagrade p&aring; systematiskt s&auml;tt i data&shy;maskin</span> <span class="deft">s&aring; att en&shy;skilda upp&shy;gifter snabbt kan hittas, t.ex. genom s&ouml;kning per kategori" </span> Utifr&aring;n en s&aring;dan definition &auml;r alla elektroniska datasamlingar en databas.&nbsp;F&ouml;r att undvika att g&ouml;ra den h&auml;r guiden till en kurs i databaskonstruktion kommer vi att n&ouml;ja oss med att presentera databastyper som fokuserar p&aring; att beskriva vetenskaplig output.</p>
                     <h3>V&auml;gen fr&aring;n f&ouml;rfattare till databas</h3>
                     <p>Vetenskaplig output kan komma i flera olika former som exempelvis: B&ouml;cker, konferenspapers, artiklar och utst&auml;llningar. N&auml;r en artikel b&ouml;rjar bli f&auml;rdig skickas den i regel till en redakt&ouml;r vid en&nbsp;tidskrift. F&ouml;rfattaren f&aring;r ocks&aring; fylla i ett formul&auml;r med information som underl&auml;ttar resursbeskrivningen i den elektroniska tidskriften. Denna information ligger ocks&aring; till grund f&ouml;r den metadata som finns kopplat till tidskriften.&nbsp;</p>
                     <p>En publicist som Elsevier och Thompson Reuter kan &auml;ga flera tidskrifter. &Auml;n s&aring; l&auml;nge har vi egentligen inte pratat om databaser alls d&auml;remot skulle en tidskrift utifr&aring;n v&aring;r tidigare definition helt klart rymmas inom v&aring;r databasdefinition.&nbsp;Nu kan det vara dags att introducera nya begrepp som databasproducent och databasv&auml;rd. En databasproducent &auml;r den som tillverkar och ansvarar f&ouml;r databasen. De best&auml;mmer databasens f&auml;ltstruktur, d.v.s. vilka uppgifter som ska finnas med. De best&auml;mmer ocks&aring; informationsinneh&aring;llet, vilka dokumenttyper som ska bevakas, spr&aring;k m.m. En typisk databasproducent kan vara ett kommersiellt f&ouml;retag/f&ouml;rlag, vetenskapliga sammanslutningar (learned societies), myndigheter, universitet m.m. Om vi tar Elsevier som exempel s&aring; &auml;r det en komersiell puiblicist som &auml;ger flera tidskrifter som ocks&aring; producerar databaser som ScienceDirect och Scopus. &nbsp;</p>
                     <p>En databasv&auml;rd &auml;r oftast en (kommersiell) v&auml;rd f&ouml;r en eller flera databaser. Databasv&auml;rden tar emot, k&ouml;per in, samlar databaser som databasproducenter konstruerat. V&auml;rden st&aring;r f&ouml;r gr&auml;nssnitt, struktur, marknadsf&ouml;ring och distributionen av databasen. D&auml;rf&ouml;r kan en och samma databas kan &aring;terfinnas hos en eller flera databasv&auml;rdar. En databasv&auml;rd och databasproducent kan ocks&aring; vara en och densamma. Detta har ocks&aring; blivit mycket vanligare sedan webbens tillkomst. M&aring;nga av de stora f&ouml;rlagen medger ocks&aring; tillg&aring;ng till artiklar i fulltext och d&aring; finns oftast en l&auml;nk mellan den bibliografiska databasen och artiklar i fulltext. Exempel p&aring; s&aring;dana databaser som biblioteket prenumererar p&aring; &auml;r Haworth Press, ScienceDirect, SpringerLink och Wiley Interscience.&nbsp;</p>
                     <p>Exempel p&aring; stora databasv&auml;rdar &auml;r CSA Illumnia, DIALOG, DataStar, EBSCO, ProQuest, STN och Thomson.</p>
                     <h1>Databastyper</h1>
                     <h2>Bibliografiska databaser</h2>
                     <p>Bibliografiska databaser eller referensdatabaser inneh&aring;ller uppgifter om ett dokument och pekar till en text som inte finns lagrad i databasen, ofta finns det en l&auml;nk som tar dig vidare till fulltextdatabasen eller tidskriften d&auml;r dokumentet finns. I delen om bibliografiska poster presenterar vi den metadata eller de delar av ett dokument som i regel finns lagrade i den h&auml;r typen av databaser. Exempel p&aring; bibliografiska databaser &auml;r; Artikels&ouml;k, ERIC (Education Resources Information Center), Inspec (Information Service for Physics, Electronics, and Computing) och LISA (Library and Information Science Abstracts). &nbsp;</p>
                     <h2>Citeringsdatabaser</h2>
                     <p>En citeringsdatabas &auml;r ganska lik en bibliografisk databas till strukturen. Liksom en bibliografisk databas inneh&aring;ller den bibliografiska poster och lagrar metadata. Det som s&auml;rskiljer en citeringsdatabas fr&aring;n andra databaser &auml;r att den lagrar information om artiklarnas referenser. Genom att spara referenserna i databasen g&aring;r det ocks&aring; att f&ouml;lja referenserna fram till refererande artiklar. Det g&ouml;r det ocks&aring; m&ouml;jligt att f&aring; ut citeringsdata exempelvis kan vi fr&aring;n Web of Science med en avgr&auml;nsning mot University of Boras f&aring; ut f&ouml;ljande data (2017-04-02): &nbsp;</p>
                     <table >
                        <tbody>
                           <tr>
                              <td>Title</td>
                              <td>Authors</td>
                              <td>Source Title</td>
                              <td>Publication Year</td>
                              <td>Volume</td>
                              <td>Issue</td>
                              <td>Total Citations</td>
                           </tr>
                           <tr>
                              <td>Pretreatment of lignocellulosic wastes to improve ethanol and biogas production: A review</td>
                              <td>Taherzadeh, Mohammad J.; Karimi, Keikhosro</td>
                              <td>INTERNATIONAL JOURNAL OF MOLECULAR SCIENCES</td>
                              <td style="text-align:right">2008</td>
                              <td style="text-align:right">9</td>
                              <td style="text-align:right">9</td>
                              <td style="text-align:right">772</td>
                           </tr>
                           <tr>
                              <td>ENZYME-BASED HYDROLYSIS PROCESSES FOR ETHANOL FROM LIGNOCELLULOSIC MATERIALS: A REVIEW</td>
                              <td>Taherzadeh, Mohammad J.; Karimi, Keikhosro</td>
                              <td>BIORESOURCES</td>
                              <td style="text-align:right">2007</td>
                              <td style="text-align:right">2</td>
                              <td style="text-align:right">4</td>
                              <td style="text-align:right">273</td>
                           </tr>
                           <tr>
                              <td>ACID-BASED HYDROLYSIS PROCESSES FOR ETHANOL FROM LIGNOCELLULOSIC MATERIALS: A REVIEW</td>
                              <td>Taherzadeh, Mohammad J.; Karimi, Keikhosro</td>
                              <td>BIORESOURCES</td>
                              <td style="text-align:right">2007</td>
                              <td style="text-align:right">2</td>
                              <td style="text-align:right">3</td>
                              <td style="text-align:right">248</td>
                           </tr>
                           <tr>
                              <td>The importance of strong carbon-metal adhesion for catalytic nucleation of single-walled carbon nanotubes</td>
                              <td>Ding, Feng; Larsson, Peter; Larsson, J. Andreas; Ahuja, Rajeev; Duan, Haiming; Rosen, Arne; Bolton, Kim</td>
                              <td>NANO LETTERS</td>
                              <td style="text-align:right">2008</td>
                              <td style="text-align:right">8</td>
                              <td style="text-align:right">2</td>
                              <td style="text-align:right">172</td>
                           </tr>
                           <tr>
                              <td>ACTION DESIGN RESEARCH</td>
                              <td>Sein, Maung K.; Henfridsson, Ola; Purao, Sandeep; Rossi, Matti; Lindgren, Rikard</td>
                              <td>MIS QUARTERLY</td>
                              <td style="text-align:right">2011</td>
                              <td style="text-align:right">35</td>
                              <td style="text-align:right">1</td>
                              <td style="text-align:right">167</td>
                           </tr>
                           <tr>
                              <td>Conversion of rice straw to sugars by dilute-acid hydrolysis</td>
                              <td>Karimi, K; Kheradmandinia, S; Taherzadeh, MJ</td>
                              <td>BIOMASS &amp; BIOENERGY</td>
                              <td style="text-align:right">2006</td>
                              <td style="text-align:right">30</td>
                              <td style="text-align:right">3</td>
                              <td style="text-align:right">150</td>
                           </tr>
                           <tr>
                              <td>Scientific collaboration</td>
                              <td>Sonnenwald, Diane H.</td>
                              <td>ANNUAL REVIEW OF INFORMATION SCIENCE AND TECHNOLOGY</td>
                              <td style="text-align:right">2007</td>
                              <td style="text-align:right">41</td>
                              <td>&nbsp;</td>
                              <td style="text-align:right">142</td>
                           </tr>
                           <tr>
                              <td>Packing mechanics of fiber reinforcements</td>
                              <td>Toll, S</td>
                              <td>POLYMER ENGINEERING AND SCIENCE</td>
                              <td style="text-align:right">1998</td>
                              <td style="text-align:right">38</td>
                              <td style="text-align:right">8</td>
                              <td style="text-align:right">133</td>
                           </tr>
                           <tr>
                              <td>Ethanol production from dilute-acid pretreated rice straw by simultaneous saccharification and fermentation with Mucor indicus, Rhizopus oryzae, and Saccharomyces cerevisiae</td>
                              <td>Karimi, Keikhosro; Emtiazi, Giti; Taherzadeh, Mohammad J.</td>
                              <td>ENZYME AND MICROBIAL TECHNOLOGY</td>
                              <td style="text-align:right">2006</td>
                              <td style="text-align:right">40</td>
                              <td style="text-align:right">1</td>
                              <td style="text-align:right">132</td>
                           </tr>
                           <tr>
                              <td>Development of flax fibre based textile reinforcements for composite applications</td>
                              <td>Goutianos, S.; Peijs, T.; Nystrom, B.; Skrifvars, M.</td>
                              <td>APPLIED COMPOSITE MATERIALS</td>
                              <td style="text-align:right">2006</td>
                              <td style="text-align:right">13</td>
                              <td style="text-align:right">4</td>
                              <td style="text-align:right">116</td>
                           </tr>
                        </tbody>
                     </table>
                     <p><br />Tittar vi l&auml;ngst till h&ouml;ger i tabellen hittar vi antal citeringar, dvs hur m&aring;nga g&aring;nger en artikel blivit refererad till i databasen Web of Science. Exempel p&aring; citeringsdatabaser: Scopus och Web of Science.&nbsp;&nbsp;</p>
                     <h2>Fulltextdatabaser</h2>
                     <p>Fulltextdatabaser (source databases) inneh&aring;ller fulltexter, det &auml;r lite olika hur fulltexterna lagras men det blir vanligare och vanligare att de g&ouml;r hela fulltexten s&ouml;kbar.&nbsp;Exempel p&aring; fulltextdatabaser &auml;r; Academic Search Premier, Haworth Press, Mediearkivet och ScienceDirect. Vi har tidigare beskrivit hur tidskrifter f&ouml;rh&aring;ller sig till publicister och vi n&auml;mnde Elseviers f&ouml;rh&aring;llande till databaserna Scopus och&nbsp;<span>ScienceDirect. Scopus &auml;r en bibliografisk citeringsdatabas och&nbsp;ScienceDirect &auml;r en fulltextdatabas, n&auml;r du s&ouml;ker i ScienceDirect s&aring; s&ouml;ker du bara bland Elseviers egna artiklar dvs. de som &auml;r publicerade i deras egna tidskrifter. I och med att de &auml;ger materialet beh&ouml;ver de inte avgr&auml;nsa sig till att s&ouml;ka i den bibliografiska posten utan du s&ouml;ker i hela fulltexten. Till Scopus kan de &aring; andra sidan knyta tidskrifter som de sj&auml;lva inte &auml;ger d&aring; beskrivande data &auml;r mer tillg&auml;ngligt. &nbsp;</span></p>
                     <h2>Faktadatabaser</h2>
                     <p>som inneh&aring;ller numeriska data eller andra faktauppgifter (t.ex. statistik, ekonomiska uppgifter eller uppgifter om medicinska effekter av olika &auml;mnen). Exempel p&aring; faktadatabaser &auml;r; ChemSpider (kemiska strukturer), Genome database, och Statistikdatabasen (SCB)</p>
                     </article>
               </div></div></div>
      
      </main>
      <footer>
         <div class="row" id="footer">
            <div class="col-sm copyright">
               <div><a href="https://creativecommons.org/licenses/by/4.0/legalcode"><img src="assets/img/logos/cc.svg" class="copyright_logo" alt="Creative Commons License"><img src="assets/img/logos/by.svg" class="copyright_logo" alt="Attribution 4.0 International"></a></div>
               <div>
                  2017 &dash; 2024
                  </div>
            </div>
         </div>
      </footer><script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.3/dist/umd/popper.min.js" integrity="sha384-ZMP7rVo3mIykV+2+9J3UJ46jBk0WLaUAdn689aCwoqbBJiSnjAK/l8WvCWPIPm49" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/js/bootstrap.min.js" integrity="sha384-ChfqqxuZUCnJSK3+MXmPNIyE6ZbWh2IMqE241rYiqJxyMiZ6OW/JmZQ5stwEULTy" crossorigin="anonymous"></script></body>
</html>