<!DOCTYPE html>
<html lang="en" xml:lang="en">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
      <title>
                    
                Libris
                </title>
      <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
      <link rel="stylesheet" href="assets/css/main.css">
      <link rel="stylesheet" href="assets/css/desktop.css">
   </head>
   <body>
      <header>
         <h1>Libris sökspråk</h1>
      </header>
      <nav id="sitenav"><a href="index.html">Hem</a> |
         <a href="bibliographic.html">Bibliografiska poster</a> |
         <a href="databasetypes.html">Databastyper</a> |
         <a href="search.html">Sökspråk</a> |
         <a href="libris.html" style="font-size : 0.9em">(Libris Sökspråk)</a> |
         <a href="strategies.html">Sökstrategier</a>
      </nav>
      <main id="manuscript">
         
            <div class="container"><div class="row">
               <div class="col-md">
                  <article class="transcription">
                     <div>
                        <h2>S&auml;rskilt om Libris</h2>
                        <p>Eftersom Libris i den h&auml;r ofta ligger i fokus f&ouml;r &ouml;vningar i informationss&ouml;kning (searching) &auml;r dess databasstruktur i termer av s k f&auml;lt av s&auml;rskild vikt, inte minst f&ouml;r att den avviker fr&aring;n de flesta andra databaser i n&aring;gra avseenden. Det g&auml;ller ocks&aring; karakt&auml;ren p&aring; inneh&aring;llet i Libris och dess struktur - exempelvis f&ouml;rekommer f&ouml;r vissa objekt olika typer av titlar som du vanligen inte finner i andra databaser - t ex originaltitel, parallelltitel och uniform titel. Det h&auml;r till&auml;gget till Marias och Thomas guide motiveras av Libris och s&ouml;ker belysa vad som &auml;r specifikt f&ouml;r s&ouml;kning i Libris.</p>
                        <p>När vi nu skriver år 2024 så befinner sig Libris i en utvecklingsfas när det gäller ersättningen av Libris Webbsök med en ny version som ska ta tillvara Libris-databasens nya struktur där bl a en skillnad görs mellan verk och instans. Vad som sägs här är dock i många stycken översättningsbart/generiskt men framöver kan vissa detaljförändringar komma att implementeras i Libris</p>
                        <h3>Inneh&aring;llet i Libris</h3>
                        <p>Att Libris utg&ouml;r v&aring;r nationalbibliografi (som fram till b&ouml;rjan av 2000-talet publicerades av Kungliga Biblioteket som "Svensk bokkatalog" och d&auml;refter som "Svensk bokf&ouml;rteckning) och d&auml;rmed f&ouml;rtecknar n&auml;rap&aring; den totala utgivningen av litteratur i Sverige och p&aring; svenska i andra l&auml;nder inger f&ouml;rst&aring;s f&ouml;rtroende. Men det &auml;r sv&aring;rare att dra gr&auml;nser f&ouml;r vad som eventuellt inte kan finnas d&auml;r, t ex i fr&aring;ga om &auml;ldre litteratur och vissa typer av litteratur. H&auml;r finns flertalet faktorer som p&aring;verkar vad vi kan f&ouml;rv&auml;nta oss att hitta, bl a en genom &aring;ren f&ouml;r&auml;nderlig pliktexemplarslag, och att det retrospektiva inf&ouml;rlivandet av data fr&aring;n de tryckta utg&aring;vorna n&auml;mnda ovan sannolikt &auml;r l&aring;ngt ifr&aring;n fullst&auml;ndigt.</p>
                        <p>Att Libris ocks&aring; utg&ouml;r de vetenskapliga bibliotekens accessions- och best&aring;ndskatalog sedan l&aring;ng tid tillbaka, och numer i viss utstr&auml;ckning &auml;ven folkbibliotekens, inger ocks&aring; f&ouml;rtroende, men undertecknad (Mikael) k&auml;nner inte till fullo vilka luckor som kan finnas. Med accessionskatalog avses h&auml;r f&ouml;rteckningen av bibliotekens f&ouml;rv&auml;rv av utl&auml;ndsk litteratur, vilken tidigare gjordes och publicerades i tryckt form, bl a som "Sveriges offentliga bibliotek - Accessionskatalog" fr&aring;n slutet av 1800-talet.</p>
                        <p>Det &auml;r d&auml;rmed klart att med avseende p&aring; t&auml;ckningsgrad s&aring; finns i och f&ouml;r sig ingen b&auml;ttre historisk dokumentation &ouml;ver svensk utgivning och universitetsbibliotekens best&aring;nd i Sverige. En s&ouml;kning efter beskrivningar av litteratur av b&auml;rartyp 'bok' ger n&auml;ra tio miljoner tr&auml;ffar. N&auml;r det d&auml;remot g&auml;ller beskrivningarnas (posternas) fullst&auml;ndighetsgrad och granulariteten i fr&aring;ga om <em>vad</em> som beskrivs ser vi dock en anm&auml;rkningsv&auml;rd variation som vi beh&ouml;ver vara medvetna om.</p>
                        <p><strong>Fullst&auml;ndighetsgrad: </strong>Dels kan m&aring;nga beskrivningar sakna uppgifter som vi f&ouml;rv&auml;ntar oss att finna, s&aring;som f&ouml;rlagsuppgifter och uppgifter om f&ouml;rfattare n&auml;r det handlar om utg&aring;vor med fler &auml;n tre f&ouml;rfattare. F&ouml;r senare tiders utgivning kan man f&ouml;rv&auml;nta sig uppgifter om &ouml;vers&auml;ttare, originalspr&aring;k och originaltitel, men det &auml;r mer s&auml;llsynt f&ouml;r &auml;ldre utg&aring;vor.</p>
                        <p><strong>Granularitet: </strong>I huvudsak f&ouml;rtecknas eller beskrivs inte enskilda h&auml;ften/nummer som ing&aring;r en en tidskrift, eller bidrag i tidskriftsnummer, inte heller verk som ing&aring;r i en s k antologi. En s&ouml;kning efter beskrivningar av litteratur av publikationstypen 'serier' (vilket inkluderar t ex tidskrifter, dagstidningar och rapportserier) ger drygt en halv miljon tr&auml;ffar.</p>
                        <p>En "tumregel" h&auml;r kan vara att ju &auml;ldre en utg&aring;va &auml;r, desto l&auml;gre fullst&auml;ndighetsgrad och granularitet kan vi f&ouml;rv&auml;nta oss. En faktor att r&auml;kna med &auml;r ocks&aring; att katalogiseringsregler har f&ouml;r&auml;ndrats &ouml;ver &aring;ren och att enskilda katalogiserande bibliotekarier har haft varierande kompetens och erfarenhet av uppdraget.</p>
                        <p>Libris f&ouml;rtecknar ocks&aring; litteratur som inte finns tillg&auml;nglig p&aring; svenska bibliotek. Dels finns f&ouml;rhandsinformation fr&aring;n f&ouml;rlagen som registreras med knapph&auml;ndig metadata, och dels finns beskrivningar importerade fr&aring;n andra nationalbibliotek som ett led i det internationella bibliografiska samarbetet.</p>
                        <h3>S&ouml;kning i Libris</h3>
                        <p>&Auml;ven om registrering av resursbeskrivningar (katalogisering) i databasen Libris huvudsakligen g&ouml;rs genom Libris XLs formul&auml;r- och RDF-baserade struktur s&aring; genereras alltid en kopia av vad som matas in, i MARC21-struktur och det &auml;r mot den h&auml;r senare strukturen som s&ouml;kningar mot databasen Libris sker &mdash; i Libris Webbs&ouml;k.</p>
                        <p>MARC21 &auml;r en komplex f&ouml;reteelse och den visserligen extensiva hj&auml;lp som ges f&ouml;r s&ouml;kning i Libris f&ouml;ruts&auml;tter p&aring; s&auml;tt och vis till en viss del en god k&auml;nnedom om MARC21, vilket du sannolikt inte har och kan beh&ouml;va lite hj&auml;lp med.</p>
                        <p>Du n&aring;r hj&auml;lpen via <a href="https://libris.kb.se/form_boolean.jsp" target="_blank" rel="noopener">https://libris.kb.se/form_boolean.jsp</a> och s&auml;rskilt l&auml;nken betitlad <a id="helplink1" target="_blank" href="http://librishelp.libris.kb.se/help/search_codes_swe.jsp?open=search_tip">Alla s&ouml;kkoder</a> inneh&aring;ller en del v&auml;sentlig hj&auml;lp f&ouml;r att formulera precisa s&ouml;kfr&aring;gor.</p>
                        <p>Det ges inte utrymme h&auml;r f&ouml;r en fullst&auml;ndig genomg&aring;ng av respektive prefix (s&ouml;kkod) som kan anv&auml;ndas i Libris f&ouml;r att rikta s&ouml;kningen mot en s&auml;rskild form av metadata&nbsp; &nbsp;&mdash; dvs ett eller flera s&auml;rskilda f&auml;lt. Libris hj&auml;lp har ut&ouml;ver en specifikation av vilka MARC21-f&auml;lt som motsvaras av respektive prefix ocks&aring; en prosaisk beskrivning som r&auml;cker ganska l&aring;ngt &auml;ven utan k&auml;nnedom om MARC21. F&ouml;r prefixet <code>OTIT </code>g&auml;ller t ex att det avser originaltitel, men "endast f&ouml;r material utgivet f&ouml;re 2004" (och sannolikt inte att lite p&aring; till 100%, se mina kommentarer under 'Inneh&aring;llet i Libris' nedan). S&ouml;kfr&aring;gan<code> OTIT:("M&auml;n som hatar kvinnor") </code>&auml;r allts&aring; inte en bra s&ouml;kfr&aring;ga, eftersom verkets f&ouml;rsta utg&aring;va kom 2005, medan&nbsp;<code> TIT:("M&auml;n som hatar kvinnor")</code> ger ett hyggligt resultat med &ouml;vers&auml;ttningar av Larssons verk.&nbsp;</p>
                        <p><code>OTIT:(saison enfer)</code> ger endast en tr&auml;ff p&aring; Helmer L&aring;ngs &ouml;vers&auml;ttning (av Rimbauds 'en tid i helvetet') utgiven 1953, men missar flera andra &ouml;vers&auml;ttningar av olika sk&auml;l. (Notera att citationstecken saknas i det h&auml;r exemplet, mot bakgrund av antagandet att de b&aring;da str&auml;ngarna 'saison' och 'enfer' borde vara tillr&auml;ckligt unika inom ett och samma f&auml;lt. Oftast &auml;r dock citationstecken att f&ouml;rorda, men en os&auml;kerhet kring t ex genus f&ouml;r det franska 'saison' kan motivera det h&auml;r). Tr&auml;ffarna f&ouml;r <code>TIT:("une saison en enfer") SPRAK:(eng) </code>hittar vi inte med prefixet <code>OTIT</code> trots att det skulle kunna f&ouml;rv&auml;ntas.</p>
                        <p>Exemplen h&auml;r ger f&ouml;rst&aring;s en os&auml;kerhet, men syftar till att skapa medvetande om en f&ouml;rsiktighet och att prova olika l&ouml;sningar. I de flesta fall kan det r&auml;cka med de prefix som Libris kallar "sammansatt s&ouml;kkod", dvs t ex TIT och F&Ouml;RF, men var allts&aring; observant &auml;ven p&aring; vad de betyder. F&Ouml;RF matchar &auml;ven illustrat&ouml;rer och redakt&ouml;rer, inte endast f&ouml;rfattare, om dessa &auml;r angivna i adekvata f&auml;lt. I kursen ing&aring;r att du f&ouml;rv&auml;ntas explorativt unders&ouml;ka och v&auml;rdera vilka prefix som kan vara anv&auml;ndbara.</p>
                        <p>S&ouml;kspr&aring;ket f&ouml;ljer annars de principer som ges i den h&auml;r guiden av Maria och Thomas och i undervisningen generellt kring s&ouml;kspr&aring;k. Det &auml;r dock tv&aring; aspekter p&aring; vad vi kan kalla teckenhantering som f&ouml;rtj&auml;nar att s&auml;rskilt lyftas fram, eftersom vi vet att de kan missf&ouml;rst&aring;s.</p>
                        <p>&nbsp;</p>
                        <p>Det f&ouml;rsta g&auml;ller att vara varsam med <em><strong>mellanslagen</strong></em>. I m&aring;nga fall ignorerar systemet extra mellanslag.</p>
                        <p><code>TIT:("M&auml;n som hatar kvinnor")</code> &auml;r ekvivalent med <code>TIT:("M&auml;n&nbsp;&nbsp;&nbsp; som hatar kvinnor")</code> och <code>TIT:( "M&auml;n som hatar kvinnor" )</code></p>
                        <p>men</p>
                        <p><code>TIT: ("M&auml;n som hatar kvinnor") </code>&auml;r det inte. Prefixets kolon m&aring;ste f&ouml;ljas direkt av de str&auml;ngar som efters&ouml;ks. H&auml;r genererar ett extra mellanslag ett felmeddelande.</p>
                        <p>&nbsp;</p>
                        <p>Det andra g&auml;ller att <em><strong>parenteser</strong></em> har tv&aring; distinkt olika funktioner i Libris.</p>
                        <p><code>TIT:("M&auml;n som hatar kvinnor")</code> &auml;r helt ekvivalent med <code>TIT:"M&auml;n som hatar kvinnor"</code> samt <strong>n&auml;stan</strong> med <code>TIT:M&auml;n TIT:som TIT:hatar TIT:kvinnor</code></p>
                        <p style="text-align: right; font-size: 0.85em;"><em>H&auml;r kan f&ouml;rst&aring;s p&aring;pekas att konjunktionen 'som' &auml;r ganska meningsl&ouml;s.</em></p>
                        <p>Parenteser anv&auml;nds h&auml;r som ett f&ouml;rkortat s&auml;tt att s&auml;ga att alla tre str&auml;ngarna ska &aring;terfinnas i titelf&auml;lten.</p>
                        <p><code>TIT:(M&auml;n som hatar kvinnor)</code> &auml;r annars helt ekvivalent med &nbsp;<code>TIT:M&auml;n TIT:som TIT:hatar TIT:kvinnor</code>, samt <code>TIT:M&auml;n AND TIT:som AND TIT:hatar AND TIT:kvinnor</code></p>
                        <p>Citationstecknen g&ouml;r allts&aring; en skillnad, som dock har begr&auml;nsad betydelse f&ouml;r utfallet h&auml;r.</p>
                        <p style="text-align: right; font-size: 0.85em;"><em>AND &auml;r underf&ouml;rst&aring;tt (implicit) f&ouml;r s&ouml;kfr&aring;gor i Libris om en operator saknas, men kan f&ouml;r tydlighets skulle inkluderas.</em></p>
                        <p>&nbsp;</p>
                        <p>Annars fungerar parenteser ocks&aring; som ett s&auml;tt att gruppera delar av s&ouml;kfr&aring;gan, p&aring; det s&auml;tt som har beskrivits tidigare i den h&auml;r guiden, som i</p>
                        <p><code>TIT:(saison enfer) AND (SPRAK:swe OR sprak:eng)</code></p>
                        <p>f&ouml;r att matcha &ouml;vers&auml;ttningar till svenska eller engelska. Prova sj&auml;lv med att ta bort den andra parentesen i Libris och se vad som h&auml;nder.</p>
                        <p>&nbsp;</p>
                        <p>Den uppm&auml;rksamme noterar att resultatet av endast</p>
                        <p><code>TIT:(saison enfer) </code></p>
                        <p>ger m&ouml;jligheten att genom gr&auml;nssnittets h&ouml;germeny filtrera p&aring; spr&aring;k &nbsp;&mdash;&nbsp; men bara p&aring; ett spr&aring;k i taget, s&aring; du f&aring;r g&ouml;ra tv&aring; s&ouml;kningar i st&auml;llet f&ouml;r en som den mer komplexa s&ouml;kfr&aring;gan ovan m&ouml;jligg&ouml;r.&nbsp;</p>
                        <p>&nbsp;</p>
                        <p><code>(TIT:M&auml;n TIT:som TIT:hatar TIT:kvinnor) NOT TIT:("M&auml;n som hatar kvinnor")</code></p>
                     </div>
                     <div>kan ges f&ouml;r att titlar som exakt matchar str&auml;ngen "M&auml;n som hatar kvinnor" sorteras bort. Vi kan se att f&ouml;rsta delen av s&ouml;kfr&aring;gan &auml;ven matchar titeln "Varf&ouml;r hatar m&auml;n kvinnor som &auml;lskar dem".</div>
                     <div>I det h&auml;r exemplet &auml;r dock str&auml;ngt taget den f&ouml;rsta parentesen on&ouml;dig. Parenteser i den h&auml;r funktionen &auml;r s&auml;rskilt viktiga n&auml;r operatorn OR &auml;r involverad.</div>
                     <div>I prosa kan vi beskriva fr&aring;gan ovan som att 'v&auml;lj f&ouml;rst ut alla beskrivningar (poster) d&auml;r str&auml;ngarna "m&auml;n", "som", "hatar" och "kvinnor" alla finns i ett av de f&ouml;rbest&auml;mda titelf&auml;lten, sortera d&auml;refter bort alla beskrivningar d&auml;r den exakta str&auml;ngen "M&auml;n som hatar kvinnor" f&ouml;rekommer finns i ett av de f&ouml;rbest&auml;mda titelf&auml;lten',</div>
                     <div >
                        <h3>Logiska kombinationer</h3>
                        <p>&Auml;ven om inneb&ouml;rden av operatorerna AND och OR f&ouml;rklaras p&aring; andra st&auml;llen s&aring; kan f&ouml;ljande illlustrationer i form av Venn-diagram vara till hj&auml;lp utan att direkt s&auml;gas vara specifika f&ouml;r Libris.</p>
                        <p>H&auml;r m&aring;ste vi t&auml;nka i termer av m&auml;ngder, dvs vi l&aring;ter t ex m&auml;ngden X vara ekvivalent med m&auml;ngden av alla beskrivningar (poster) som inneh&aring;ller str&auml;ngen x, m&auml;ngden Y vara ekvivalent med m&auml;ngden av alla beskrivningar (poster) som inneh&aring;ller str&auml;ngen y och m&auml;ngden Z vara ekvivalent med m&auml;ngden av alla beskrivningar (poster) som inneh&aring;ller str&auml;ngen z. Somliga beskrivningar inneh&aring;ller sannolikt flera av dessa str&auml;ngar z, y och z. De &ouml;verlappande ytorna i illustrationen nedan visar storleken p&aring; dessa delm&auml;ngder och vilka s&ouml;kfr&aring;gor som skulle generera dem. Den minsta delm&auml;ngden tr&auml;ffar f&aring;r vi allts&aring; med s&ouml;kfr&aring;gan <code>X AND Y AND Z</code>.</p>
                        <p><img src="assets/img/documents/venn-AND.svg" alt="venn-diagram AND"/><br><em class="captions">Figur 4.1</em>: Logiskt OCH</p>
                        <p>&nbsp;</p>
                        <p>Den s k unionen av tv&aring; m&auml;ngder &auml;r resultatet av en logisk disjunktion X OR Y och innefattar de tre m&auml;ngderna X, Y och X AND Y - det finns allts&aring; ett snitt, en m&auml;ngd som svarar mot b&aring;de kriteriet att str&auml;ngen x ska finnas och samtidigt str&auml;ngen y. Om det finns 50 beskrivningar som inneh&aring;ller str&auml;ngen x och 50 som inneh&aring;ller str&auml;ngen y s&aring; blir det inte 100 tr&auml;ffar s&aring; l&auml;nge som X AND Y inte &auml;r en tom m&auml;ngd, att det med andra ord inte finns n&aring;gon beskrivning som inneh&aring;ller b&aring;da str&auml;ngarna x och y.</p>
                        <p><img src="assets/img/documents/venn-OR-1.svg" alt="venn-diagram OR"/><br><em class="captions">Figur 4.2</em>: Logiskt ELLER</p>
                        <p>F&ouml;r vi d&auml;remot in m&auml;ngden Z i resonemanget igen s&aring; ser vi exempel p&aring; n&auml;r parenteser &auml;r n&ouml;dv&auml;ndiga.</p>
                        <p><img src="assets/img/documents/venn-AND-OR-1.svg" alt="venn-diagram AND och OR"/><br><em class="captions">Figur 4.3</em>: Kombination av logiskt OCH och ELLER</p>
                        <p>X OR Y AND Z ger helt enkelt en annan (mindre) m&auml;ngd, eftersom det &auml;r liktydigt med X OR (Y AND Z) i de flesta system, inklusive Libris.</p>
                     </div>
                     </article>
               </div></div></div>
      
      </main>
      <footer>
         <div class="row" id="footer">
            <div class="col-sm copyright">
               <div><a href="https://creativecommons.org/licenses/by/4.0/legalcode"><img src="assets/img/logos/cc.svg" class="copyright_logo" alt="Creative Commons License"><img src="assets/img/logos/by.svg" class="copyright_logo" alt="Attribution 4.0 International"></a></div>
               <div>
                  2017 &dash; 2024
                  </div>
            </div>
         </div>
      </footer><script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.3/dist/umd/popper.min.js" integrity="sha384-ZMP7rVo3mIykV+2+9J3UJ46jBk0WLaUAdn689aCwoqbBJiSnjAK/l8WvCWPIPm49" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/js/bootstrap.min.js" integrity="sha384-ChfqqxuZUCnJSK3+MXmPNIyE6ZbWh2IMqE241rYiqJxyMiZ6OW/JmZQ5stwEULTy" crossorigin="anonymous"></script></body>
</html>