<!DOCTYPE html>
<html lang="en" xml:lang="en">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
      <title>
                    
                    Sökspråk
                </title>
      <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous"/>
      <link rel="stylesheet" href="assets/css/main.css"/>
      <link rel="stylesheet" href="assets/css/desktop.css"/>
   </head>
   <body>
      <header>
         <h1>Sökspråk</h1>
      </header>
      <nav id="sitenav"><a href="index.html">Hem</a> |
         <a href="bibliographic.html">Bibliografiska poster</a> |
         <a href="databasetypes.html">Databastyper</a> |
         <a href="search.html">Sökspråk</a> |
         <a href="libris.html" style="font-size : 0.9em">(Libris Sökspråk)</a> |
         <a href="strategies.html">Sökstrategier</a>
      </nav>
      <main>
         <div class="container">
            
            
               
            <div class="row">
               
               <div class="col-md">
                  <article class="transcription">
                     
                     <p>N&auml;r man s&ouml;ker i en modern s&ouml;kmotor f&aring;r man ofta m&aring;nga tr&auml;ffar, men kanske inte exakt p&aring; det man s&ouml;kte. S&ouml;kmotorn testar till exempel oftast med och utan vanliga &auml;ndelser p&aring; ordet. S&ouml;ker man i en annan typ av databas fungerar det d&auml;remot annorlunda - i allm&auml;nhet. Eftersom olika databasproducenter sj&auml;lva best&auml;mmer hur just deras databas fungerar kan det variera lite. Det som s&auml;gs i nedanst&aring;ende text &auml;r en beskrivning av hur det fungerar i de flesta av de bibliografiska databaser du kommer st&ouml;ta p&aring; genom din utbildning h&auml;r. Vill du ha mer precisa instruktioner rekommenderas l&auml;sning i hj&auml;lpsidorna f&ouml;r den databas du vill anv&auml;nda. I det f&ouml;ljande avses med "databas" just en bibliografisk databas, allts&aring; inte s&ouml;kmotorer.</p>
<h3>S&ouml;kning</h3>
<p>Informationss&ouml;kning har sin grund i att man vill veta n&aring;got - man har ett<em> informationsbehov</em>. F&ouml;r att s&ouml;ka i en databas beh&ouml;ver vi &ouml;vers&auml;tta v&aring;rt informationsbehov till en <em>s&ouml;kfr&aring;ga</em> (&auml;ven kallat <em>s&ouml;kstr&auml;ng</em>).</p>
<p>En s&ouml;kfr&aring;ga best&aring;r en eller flera termer (eller uttryck). Beroende p&aring; databas finns det ocks&aring; lite olika <em>s&ouml;kkoder </em>och <em>booleska operatorer </em>som vi kan anv&auml;nda tillsammans med de termer vi s&ouml;ker p&aring;. Vi kommer komma in mer p&aring; det nedan. Dessa anv&auml;nds f&ouml;r att g&ouml;ra s&ouml;kningen bredare, vilket ger fler tr&auml;ffar, eller sn&auml;vare, vilket ger f&auml;rre tr&auml;ffar. Vad s&ouml;kkoderna och operatorerna kallas samt i vilken ordning de kommer att l&auml;sas av databasen varierar beroende p&aring; vilken databas det &auml;r. Olika databaser har olika syntax (skrivregler).</p>
<p style="margin: 1em; padding: 1em; border: 1px solid red; color: green;">Det kan vara v&auml;rt att stanna upp h&auml;r lite grann och konstatera att ordet 'termer' ovan kan antyda att det i s&ouml;kfr&aring;gan <code>bibliotek AND undervisning</code> anv&auml;nds tv&aring; termer med en distinkt begreppslig betydelse. Det &auml;r endast fallet under s&auml;rskilda f&ouml;rh&aring;llanden, i de flesta fall handlar det om en kombination av tv&aring; str&auml;ngar av alfanumeriska tecken som ska matchas mot andra str&auml;ngar i databasen. F&ouml;r en maskin existerar blott och bart teckenstr&auml;ngar som saknar mening. I den. h&auml;r guiden anv&auml;nds f&ouml;r enkelhets skull &auml;nd&aring; uttrycket 'termer'.</p>
<h3>Exakt matchning</h3>
<p>Om du s&ouml;ker p&aring; "bibliotek" i en databas kommer du f&aring; tillbaka alla poster som inneh&aring;ller ordet "bibliotek" n&aring;gonstans i posten. D&auml;remot kommer du inte f&aring; tr&auml;ff p&aring; en post som inneh&aring;ller ordet "biblioteken", om den inte ocks&aring; inneh&aring;ller ordet "bibliotek" n&aring;gon annanstans i posten. Databasen kommer n&auml;mligen g&ouml;ra en exakt matchning av orden, s&aring; &auml;ven om orden &auml;r lika s&aring; kommer de inte ge tr&auml;ff om de inte &auml;r identiska. D&auml;remot brukar det inte spela n&aring;gon roll om s&ouml;korden &auml;r skrivna med gemener (sm&aring; bokst&auml;ver) eller versaler (stora bokst&auml;ver) - med undantag f&ouml;r de koder som anv&auml;nds av systemet sj&auml;lvt.</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>bibliotek</p>
            </td>
            <td>
                <p>Bibliotek p&aring; skolor blir...</p>
            </td>
            <td>
                <p>Skolbibliotek blir...</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>biblioteken</p>
            </td>
            <td>Det blir viktigare f&ouml;r biblioteken att...</td>
            <td>Det blir viktigare f&ouml;r bibliotek att...</td>
        </tr>
    </tbody>
</table>
<h3>Trunkering</h3>
<p>Ibland vill man f&aring; tr&auml;ff p&aring; till exempel pluralform och andra &auml;ndelser av ett ord. Ist&auml;llet f&ouml;r att skriva in alla t&auml;nkbara varianter kan man anv&auml;nda <em>trunkering</em>. Det inneb&auml;r att ett tecken (oftast en asterisk *) skrivs in f&ouml;r att visa att man vill ha alla m&ouml;jliga &auml;ndelser p&aring; ordet. F&ouml;r det mesta &auml;r det bara till&aring;tet att anv&auml;nda trunkering i slutet av ord, men ibland g&aring;r det &auml;ven att g&ouml;ra det i b&ouml;rjan av ord. Kolla p&aring; hj&auml;lpsidorna f&ouml;r den databas du anv&auml;nder f&ouml;r att se vad som g&auml;ller.</p>
<p>Trunkering &auml;r ol&auml;mpligt om ordstammen man s&ouml;ker p&aring; &auml;r kort, d&aring; det oftast finns m&aring;nga irrelevanta ord som ocks&aring; kommer att ge tr&auml;ff. I s&aring;dana fall &auml;r det b&auml;ttre att ange vilka ordformer man &auml;r intresserad av, vilket man g&ouml;r med hj&auml;lp av den booleska operatorn OR. Mer om det l&auml;ngre ned.</p>
<p>&nbsp;</p>
<table >
    <tbody>
        <tr>
            <td></td>
            <td></td>
            <td></td>
        </tr>
        <tr>
            <td>
                <p>bibliotek*</p>
            </td>
            <td>
                <p>Det blir viktigare f&ouml;r bibliotek att... <br /><em>men ocks&aring;</em> <br />Det blir viktigare f&ouml;r biblioteken att...</p>
            </td>
            <td>
                <p>Skolbibliotek blir...</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>cat*</p>
            </td>
            <td>
                <p>Cat och cats men ocks&aring; catalog, catch, category med flera.</p>
            </td>
            <td>&nbsp;</td>
        </tr>
    </tbody>
</table>
<p>&nbsp;</p>
<p style="margin: 1em; padding: 1em; border: 1px solid red; color: green;">Var alllts&aring; s&auml;rskilt uppm&auml;rksam p&aring; att resulterande kombinationer inte blir missvisande. Vill du f&aring; med alla b&ouml;jningsformer av substantivet 'cirkel' s&aring; &auml;r <code>cirk* </code>inte en bra l&ouml;sning, eftersom det matchar &auml;ven cirkul&auml;r, cirka, cirkus ... f&ouml;r att ta ett annat exempel</p>
<h3>Maskering</h3>
<p>Maskering liknar trunkering, men anv&auml;nds f&ouml;r att ers&auml;tta exakt ett tecken. Det kan vara anv&auml;ndbart f&ouml;r ord som kan stavas p&aring; olika s&auml;tt, till exempel om man vill ta med b&aring;de brittisk och amerikansk stavning av ett ord. Maskering kan b&aring;de anv&auml;ndas inuti och i slutet av ord, men i allm&auml;nhet inte som f&ouml;rsta tecken. Ofta anv&auml;nds ett fr&aring;getecken ? f&ouml;r att maskera. F&ouml;r att vara s&auml;ker p&aring; vad som g&auml;ller i den databas du s&ouml;ker, kolla i hj&auml;lpen.</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>organi?ation</p>
            </td>
            <td>
                <p>organisation <br />organization</p>
            </td>
        </tr>
    </tbody>
</table>
<h3>Booleska operatorer</h3>
<p style="margin: 1em; padding: 1em; border: 1px solid red; color: green;">De operatorer som beskrivs nedan &auml;r av central betydelse f&ouml;r att formulera komplexa s&ouml;kfr&aring;gor och har l&aring;nats fr&aring;n satslogiken och m&auml;ngdalgebran. De &auml;r allts&aring; i grund och botten matematiskt grundade. Det logiska OCH betyder inte riktigt samma sak som OCH i allm&auml;nt talspr&aring;k.&nbsp;<br />En l&aring;ntagares p&aring;st&aring;ende: "Jag vill ha allt som Wordsworth och Coleridge skrivit" kan (i Libris) &ouml;vers&auml;ttas formellt till<br /><code>F&Ouml;RF:(William Wordsworth) OCH F&Ouml;RF:(Samuel Coleridge)</code> eller <code>F&Ouml;RF:(William Wordsworth) ELLER F&Ouml;RF:(Samuel Coleridge) </code>beroende p&aring; om l&aring;ntagaren endast &ouml;nskar samf&ouml;rfattade eller samutgivna verk eller den totala produktionen av verk av antingen Coleridge eller Wordsworth.</p>
<p>Ofta vill man kombinera flera olika termer i en s&ouml;kfr&aring;ga. Det g&ouml;r man med hj&auml;lp av de <em>booleska operatorerna AND, OR </em>och <em>NOT</em>. I en del system till&auml;mpas OCH, ELLER och INTE ist&auml;llet, men de engelska varianterna &auml;r vanligare. Till skillnad fr&aring;n termerna du skriver in i s&ouml;kfr&aring;gan &auml;r de booleska operatorerna i allm&auml;nhet skiftl&auml;gesk&auml;nsliga, det vill s&auml;ga, det spelar roll ifall de skrivs med gemener eller versaler.</p>
<h4>AND</h4>
<p>AND anv&auml;nds f&ouml;r att s&auml;ga att b&aring;da termer m&aring;ste finnas med i en relevant post. I de flesta databaser r&auml;knas &auml;ven ett mellanslag som AND.</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>bibliotek AND tillg&auml;nglighet</p>
            </td>
            <td>
                <p>Allt fler bibliotek arbetar med tillg&auml;nglighet.</p>
            </td>
            <td>
                <p>Allt fler bibliotek arbetar med m&aring;ngfald.</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>bibliotek tillg&auml;nglighet</p>
            </td>
            <td>
                <p>Allt fler bibliotek arbetar med tillg&auml;nglighet.</p>
            </td>
            <td>
                <p>Allt fler bibliotek arbetar med m&aring;ngfald.</p>
            </td>
        </tr>
    </tbody>
</table>
<h3>OR</h3>
<p>OR anv&auml;nds f&ouml;r att s&auml;ga att n&aring;gon av termerna m&aring;ste finnas med i en relevant post. Det &auml;r anv&auml;ndbart om man vill s&ouml;ka p&aring; flera synonymer samtidigt eller olika ordformer n&auml;r det inte passar med trunkering.</p>
<table>
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>bibliotek OR folkbibliotek</p>
            </td>
            <td>
                <p>Allt fler bibliotek arbetar med tillg&auml;nglighet. <br /><em>men ocks&aring;</em> <br />Allt fler folkbibliotek arbetar med tillg&auml;nglighet.</p>
            </td>
        </tr>
    </tbody>
</table>
<h3>NOT</h3>
<p>NOT anv&auml;nds f&ouml;r att s&auml;ga att en viss term inte f&aring;r finnas med i en relevant post. Det kan vara anv&auml;ndbart om man uppt&auml;cker att man f&aring;tt irrelevanta tr&auml;ffar som handlar om en aspekt av en term som man inte &auml;r intresserad av, eller om termen har en homonym som inte &auml;r av intresse. Oavsett fall kan man ibland hitta andra ord som i s&aring; fall ocks&aring; finns med i de irrelevanta posterna, men som inte finns med i de relevanta. Man b&ouml;r vara f&ouml;rsiktig n&auml;r man anv&auml;nder NOT s&aring; att man inte tar bort relevanta tr&auml;ffar. I s&ouml;kmotorer anv&auml;nds oftast ett minustecken (-) med samma funktion.</p>
<p>Ett tillf&auml;lle n&auml;r NOT &auml;r mycket anv&auml;ndbart &auml;r om man gjort en s&ouml;kning, g&aring;tt igenom tr&auml;fflistan och d&auml;refter breddar s&ouml;kningen. I s&aring; fall vill man slippa g&aring; igenom samma tr&auml;ffar igen, vilket man kan undvika genom att l&auml;gga till NOT och den f&ouml;rsta s&ouml;ksfr&aring;gan inom parentes. P&aring; s&aring; vis f&aring;r man bara de nya tr&auml;ffarna i den nya tr&auml;fflistan.</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>h&ouml;gskolebibliotek NOT folkbibliotek</p>
            </td>
            <td>
                <p>M&aring;nga h&ouml;gskolebibliotek...</p>
            </td>
            <td>
                <p>M&aring;nga h&ouml;gskolebibliotek och folkbibliotek...</p>
            </td>
        </tr>
        <tr>
            <td>
                <p>h&ouml;gskolebibliotek -folkbibliotek</p>
            </td>
            <td>
                <p>M&aring;nga h&ouml;gskolebibliotek...</p>
            </td>
            <td>
                <p>M&aring;nga h&ouml;gskolebibliotek och folkbibliotek...</p>
            </td>
        </tr>
    </tbody>
</table>
<p>&nbsp;</p>
<h4>Att kombinera olika operatorer - t&auml;nk p&aring; prioriteringsordningen</h4>
<p>Det finns en f&ouml;rbest&auml;md prioriteringsordning som operatorerna kommer att l&auml;sas i. Det motsvarar operatorordningen i ett matematiskt tal, d&auml;r multiplikation (*) och division (/) l&ouml;ses f&ouml;re addition (+) och subtraktion (-). Det g&ouml;r att talet 3+2*10 &auml;r lika med 23 och inte 50. Vill man bryta denna ordning kan man anv&auml;nda sig av parenteser (3+2)*10=50. Parenteser anv&auml;nds p&aring; motsvarande s&auml;tt f&ouml;r booleska operatorer. Till skillnad fr&aring;n matematiska tal finns det dock ingen allm&auml;ngiltig &ouml;verenskommelse om prioriteringsordningen f&ouml;r de booleska operatorerna - &aring;terigen, l&auml;s i hj&auml;lpen eller testa dig fram f&ouml;r att ta reda p&aring; vad som g&auml;ller i den databas du anv&auml;nder. Den vanligaste ordningen &auml;r AND, OR, NOT, vilket nedanst&aring;ende exempel utg&aring;r fr&aring;n.</p>
<table>
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>l&auml;sfr&auml;mjande AND skolbibliotek OR folkbibliotek</p>
            </td>
            <td>
                <p>M&aring;nga skolbibliotek arbetar med l&auml;sfr&auml;mjande. <br /><em>men ocks&aring;</em> <br />M&aring;nga folkbibliotek har problem med f&ouml;rkomna b&ouml;cker.</p>
            </td>
            <td>&nbsp;</td>
        </tr>
        <tr>
            <td>
                <p>l&auml;sfr&auml;mjande AND (skolbibliotek OR folkbibliotek)</p>
            </td>
            <td>
                <p>M&aring;nga skolbibliotek arbetar med l&auml;sfr&auml;mjande.</p>
            </td>
            <td>M&aring;nga folkbibliotek har problem med f&ouml;rkomna b&ouml;cker.</td>
        </tr>
    </tbody>
</table>
<p>&nbsp; <br />Observera skillnaden mellan det f&ouml;rsta och det andra exemplet. N&auml;r parentesen saknas kommer databasen tolka det som att antingen termerna "l&auml;sfr&auml;mjande" och "skolbibliotek" m&aring;ste finnas i samma post f&ouml;r att den ska vara relevant, eller enbart termen "folkbibliotek". Det &auml;r l&auml;tt h&auml;nt att missa parentesen vid en listning av synonymer och d&auml;rf&ouml;r f&aring; m&aring;nga irrelevanta tr&auml;ffar - var d&auml;rf&ouml;r alltid uppm&auml;rksam om antalet tr&auml;ffar blir ov&auml;ntat m&aring;nga.</p>
<h3>Frass&ouml;kning</h3>
<p>Ibland vill man s&ouml;ka p&aring; flera termer i kombination, n&aring;got som &auml;r speciellt vanligt i engelskan d&auml;r m&aring;nga begrepp skrivs is&auml;r - exempelvis <em>public library</em>. F&ouml;r att s&ouml;ka p&aring; tv&aring; (eller fler) termer i en f&ouml;ljd beh&ouml;ver man anv&auml;nda frass&ouml;kning. Oftast anv&auml;nds citattionstecken (") f&ouml;r att markera en fras: "public library". Varf&ouml;r d&aring;? Jo, eftersom mellanslag tolkas som AND (i vissa databaser) kommer de b&aring;da termerna annars att ge tr&auml;ff oavsett var i posten de befinner sig, &auml;ven om de inte st&aring;r tillsammans. Detta fungerar &auml;ven i de flesta s&ouml;kmotorer.</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>public library</p>
            </td>
            <td>
                <p><span class="snippet ">Analyzing Public Library Service Interactions <br /><em>men ocks&aring;</em> <br />The public relations work of a bank library. </span></p>
            </td>
            <td>&nbsp;</td>
        </tr>
        <tr>
            <td>&nbsp;"public library"</td>
            <td>&nbsp;<span class="snippet ">Analyzing Public Library Service Interactions</span></td>
            <td>&nbsp;<span class="snippet ">The public relations work of a bank library.</span></td>
        </tr>
    </tbody>
</table>
<h3>N&auml;rhetsoperatorer</h3>
<p>N&aring;got som liknar frass&ouml;kningen &auml;r s&ouml;kning med n&auml;rhetsoperatorer. Ist&auml;llet f&ouml;r att kr&auml;va att termerna ska komma i direkt f&ouml;ljd efter varandra, och i den angivna ordningen, s&auml;ger man att de ska finnas i n&auml;rheten av varandra i posten. N&auml;rhetsoperatorer finns i lite olika varianter i olika databaser. I LISA heter n&auml;rhetsoperatorn NEAR och kan anv&auml;ndas tillsammans med en siffra d&auml;r man anger hur m&aring;nga ord de b&aring;da termerna som mest f&aring;r ha mellan sig</p>
<table >
    <tbody>
        <tr>
            <td>
                <p><strong>Exempel, s&ouml;kfr&aring;ga</strong></p>
            </td>
            <td>
                <p><strong>Ger tr&auml;ff p&aring;...</strong></p>
            </td>
            <td>
                <p><strong>Ger inte tr&auml;ff p&aring;...</strong></p>
            </td>
        </tr>
        <tr>
            <td>
                <p>reading NEAR/3 dogs</p>
            </td>
            <td>
                <p><span class="snippet "> <span class="hit"> <span class="hiddenText">...</span>Reading </span> <span class="hit">Dog</span>sessions... <br /><em>men ocks&aring; <br /></em>..."<span class="hit">Reading</span> to <span class="hit">Dogs</span>"... <br /></span></p>
            </td>
            <td>&nbsp;<span class="snippet ">...pleasure <span class="hit">reading</span>, I told him... <br />I still have that <span class="hit">dog</span>-eared book... </span></td>
        </tr>
    </tbody>
</table>
<p>&nbsp; <br />J&auml;mf&ouml;rt med motsvarande frass&ouml;kning - "reading dogs" - skulle den inte ge tr&auml;ff p&aring; "reading to dogs" &auml;ven om det i sammanhanget &auml;r lika relevant (eftersom l&auml;shundar &auml;r hundar som man l&auml;ser h&ouml;gt f&ouml;r).</p>
<h3>F&auml;lts&ouml;kning</h3>
<p>Om en s&ouml;kning ger v&auml;ldigt m&aring;nga tr&auml;ffar kan man beh&ouml;va avgr&auml;nsa den. Man vill d&aring; bli av med de tr&auml;ffar som &auml;r minst relevanta, men beh&aring;lla de som &auml;r mest relevanta - med andra ord &ouml;ka precisionen. Ett s&auml;tt som ofta fungerar bra &auml;r att rikta s&ouml;kningen mot ett specifikt f&auml;lt. Det betyder att man bara s&ouml;ker p&aring; en viss del av posten, till exempel enbart mot f&auml;ltet f&ouml;r f&ouml;rfattarnamn eller enbart mot f&auml;ltet f&ouml;r titeln.</p>
<p>Detta kan ofta g&ouml;ras via formul&auml;r - h&aring;ll utkik efter l&auml;nken "Avancerad s&ouml;kning"/"Advanced search". Men man kan ocks&aring; anv&auml;nda s&ouml;kkoder direkt i sin s&ouml;kfr&aring;ga. Det har f&ouml;rdelen att det g&aring;r snabbare om det &auml;r en databas man anv&auml;nder mycket. Det &auml;r ocks&aring; l&auml;ttare att kopiera s&ouml;kfr&aring;gan i sin helhet om man exempelvis vill upprepa s&ouml;kningen en annan dag.</p>
<p>Vilka s&ouml;kkoder som anv&auml;nds varierar mycket mellan olika databaser. F&ouml;ljande &auml;r exempel p&aring; n&aring;gra anv&auml;ndbara s&ouml;kkoder som finns i LISA:</p>
<table>
    <tbody>
        <tr>
            <td><strong>F&auml;lt</strong></td>
            <td><strong>S&ouml;kkod</strong></td>
            <td><strong>Exempel, s&ouml;kfr&aring;ga</strong></td>
        </tr>
        <tr>
            <td>F&ouml;rfattare (author)</td>
            <td>AU</td>
            <td>AU(wilson)</td>
        </tr>
        <tr>
            <td>Abstract</td>
            <td>AB</td>
            <td>AB("public libraries")</td>
        </tr>
        <tr>
            <td>Titel</td>
            <td>TI</td>
            <td>TI("public libraries")</td>
        </tr>
        <tr>
            <td>&Auml;mnesord (subject heading)</td>
            <td>SU</td>
            <td>SU("public libraries")</td>
        </tr>
    </tbody>
</table>
<p><br />En posts &auml;mnesord (subject heading/descriptor) &auml;r i allm&auml;nhet h&auml;mtade fr&aring;n en kontrollerad vokabul&auml;r. Kolla upp s&aring; att termen du vill s&ouml;ka p&aring; finns i vokabul&auml;ren innan du s&ouml;ker - och om vokabul&auml;ren kan ge dig fler termer av intresse.</p>
<h3>Kombinera allt ovanst&aring;ende</h3>
<p>N&auml;r du v&auml;l f&aring;tt koll p&aring; grunderna kan du kombinera alltsammans till mycket precisa s&ouml;kfr&aring;gor. Men oftast kan det vara bra att testa med en del i taget innan man pusslar ihop helheten.</p>
                     </article>
               </div>
            </div>
         </div>
      </main>
      <footer>
         <div class="row" id="footer">
            <div class="col-sm copyright">
               <div><a href="https://creativecommons.org/licenses/by/4.0/legalcode"><img src="assets/img/logos/cc.svg" class="copyright_logo" alt="Creative Commons License"><img src="assets/img/logos/by.svg" class="copyright_logo" alt="Attribution 4.0 International"></a></div>
               <div>
                  2017 &dash; 2024
                  </div>
            </div>
         </div>
      </footer><script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.3/dist/umd/popper.min.js" integrity="sha384-ZMP7rVo3mIykV+2+9J3UJ46jBk0WLaUAdn689aCwoqbBJiSnjAK/l8WvCWPIPm49" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/js/bootstrap.min.js" integrity="sha384-ChfqqxuZUCnJSK3+MXmPNIyE6ZbWh2IMqE241rYiqJxyMiZ6OW/JmZQ5stwEULTy" crossorigin="anonymous"></script></body>
</html>