<!DOCTYPE html>
<html lang="en" xml:lang="en">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
      <title>
                    
                    Sökstrategier
                </title>
      <link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" crossorigin="anonymous">
      <link rel="stylesheet" href="assets/css/main.css">
      <link rel="stylesheet" href="assets/css/desktop.css">
   </head>
   <body>
      <header>
         <h1>Sökstrategier</h1>
      </header>
      <nav id="sitenav"><a href="index.html">Hem</a> |
         <a href="bibliographic.html">Bibliografiska poster</a> |
         <a href="databasetypes.html">Databastyper</a> |
         <a href="search.html">Sökspråk</a> |
         <a href="libris.html" style="font-size : 0.9em">(Libris Sökspråk)</a> |
         <a href="strategies.html">Sökstrategier</a>
      </nav>
      <main>
         <div class="container">
            
            
            <div class="row">
               
               <div class="col-md">
                  <article class="transcription">
                     
                     <p>Det finns flera olika s&ouml;kstrategier. I den h&auml;r delen av informationss&ouml;kningsguiden&nbsp;presenteras:</p>
                     <p>- Enkel s&ouml;kning (Easy Search eller i vardagligt tal, Quick &amp; Dirty) <br />- Bygga block (Building Blocks) <br />- P&auml;rlodling (Pearl Groving) <br />- Successiv facetts&ouml;kning (Successive Facet Search)</p>
                     <p><strong>Enkel s&ouml;kning</strong> &auml;r en effektiv s&ouml;kning som &auml;r relativt kort och okomplicerad. Denna s&ouml;kning syftar fr&auml;mst till att f&aring; en &ouml;verblick &ouml;ver hur mycket som finns (eller om n&aring;got finns &ouml;verhuvudtaget) i databasen. Genom att titta p&aring; n&aring;gra av de relevanta posterna som &aring;terfunnits kan man f&aring; tips om fler och kanske b&auml;ttre termer f&ouml;r att bygga vidare p&aring;. Enkel s&ouml;kning kan d&auml;rf&ouml;r vara en bra strategi att utg&aring; fr&aring;n i sina vidare s&ouml;kningar.</p>
                     <p><strong>Bygga block</strong> &auml;r kanske den allra vanligaste strategin som en informationsspecialist anv&auml;nder sig av. Med hj&auml;lp av denna strategi delas fr&aring;ga upp i flera segment d&auml;r man f&ouml;rs&ouml;ker hitta synonymer och/eller likv&auml;rdiga ord inom varje segment f&ouml;r att bilda OR-block mellan dessa fraser och termer. N&auml;r man s&aring; bildat ett antal block som t&auml;cker in informationsbehovet kombineras sedan dessa block med AND-operatorn.</p>
                     <p>Exempel: Har h&ouml;rt att man kan anv&auml;nda sig av amfetamin som terapimetod f&ouml;r att hj&auml;lpa hyperaktiva barn och ungdomar. Finns d&auml;r n&aring;gon forskning kring detta?</p>
                     <p>Vi kan i informationsbehovet ovan utl&auml;sa tre segment, amfetamin, hyperaktivitet och barn/ungdomar. Terapimetod kommer underf&ouml;rst&aring;tt att t&auml;ckas in om vi kombinerar dessa tre segment och beh&ouml;ver d&auml;rf&ouml;r inte t&auml;ckas in.</p>
                     <table>
                        <tbody>
                           <tr>
                              <td style="padding: 1em;">
                                 <p>Segment 1</p>
                              </td>
                              <td style="padding: 1em;" >
                                 <p>&nbsp;</p>
                              </td>
                              <td style="padding: 1em;">
                                 <p>Segment 2</p>
                              </td>
                              <td style="padding: 1em;" >
                                 <p>&nbsp;</p>
                              </td>
                              <td style="padding: 1em;" >
                                 <p>Segment 3</p>
                              </td>
                           </tr>
                           <tr>
                              <td style="padding: 1em;" >
                                 <p>Amphetamine* <br />OR Benzedrine* <br />OR Phenethylamines*</p>
                                 <p>&nbsp;</p>
                              </td>
                              <td style="padding: 1em;" >
                                 <p>&nbsp;AND</p>
                              </td>
                              <td style="padding: 1em;">
                                 <p>&ldquo;hyper active&rdquo; <br />OR ADHD <br />OR &rdquo;Attention Deficit&rdquo; <br />OR DAMP</p>
                              </td>
                              <td style="padding: 1em;">
                                 <p>&nbsp;AND</p>
                              </td>
                              <td style="padding: 1em;">
                                 <p>kid* <br />OR youth* <br />OR child* <br />OR adolescen* <br />OR Teen*</p>
                              </td>
                           </tr>
                        </tbody>
                     </table>
                     <p>&nbsp;</p>
                     <p><strong>P&auml;rlodling</strong> utg&aring;r fr&aring;n en redan k&auml;nd och relevant referens. Fr&aring;n denna referens kan vi finna fler och b&auml;ttre termer som t&auml;cker v&aring;rt informationsbehov. Vi kan se om f&ouml;rfattaren/forskaren skrivit n&aring;got mer i &auml;mnet. I vilken tidskrift var artikeln publicerad. Sannolikheten att hitta fler artiklar inom samma omr&aring;de i den tidskriften b&ouml;r vara h&ouml;ga. &Auml;r dokumentet klassificerat? Anv&auml;nd klassifikationskoden (ofta i kombination med n&aring;gra ytterligare termer) f&ouml;r att se vad mer som finns. Dokumentet har en referenslista, finns d&auml;r n&aring;got anv&auml;ndbart? &Auml;r &rdquo;mitt&rdquo; dokument citerat av n&aring;gra andra? Vilka av de anv&auml;nda referenserna har ocks&aring; anv&auml;nts av andra?</p>
                     <p><strong>Successiv facetts&ouml;kning</strong> inneb&auml;r att ni bygger upp er s&ouml;kning med term f&ouml;r term och sedan utnyttjar databasens s&ouml;khistorik f&ouml;r att kombinera i olika varianter. <br />Exempel: <br /><br />Cars #1 = 24700 <br />Automobiles #2 = 98538 <br />Vehicles #3 = 68474 <br />Fuels #4 = 19876 <br />Diesel #5 = 12755 <br />Petroleum #6 = 44221 <br />Economy #7 = 11776 <br /><br />D&aring; kombinerar man I enlighet med (#1 OR #2 OR #3) AND (#4 OR #5 OR #6) AND #7 = 321 &Aring;terst&aring;r d&aring; 321 tr&auml;ffar i databasen som alla inneh&aring;ller minst en term fr&aring;n varje segment.</p>
                     
                     
                     </article>
               </div>
            </div>
         </div>
      </main>
      <footer>
         <div class="row" id="footer">
            <div class="col-sm copyright">
               <div><a href="https://creativecommons.org/licenses/by/4.0/legalcode"><img src="assets/img/logos/cc.svg" class="copyright_logo" alt="Creative Commons License"><img src="assets/img/logos/by.svg" class="copyright_logo" alt="Attribution 4.0 International"></a></div>
               <div>
                  2017 &dash; 2024
                  </div>
            </div>
         </div>
      </footer><script src="https://code.jquery.com/jquery-3.3.1.slim.min.js" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/popper.js@1.14.3/dist/umd/popper.min.js" integrity="sha384-ZMP7rVo3mIykV+2+9J3UJ46jBk0WLaUAdn689aCwoqbBJiSnjAK/l8WvCWPIPm49" crossorigin="anonymous"></script><script src="https://cdn.jsdelivr.net/npm/bootstrap@4.1.3/dist/js/bootstrap.min.js" integrity="sha384-ChfqqxuZUCnJSK3+MXmPNIyE6ZbWh2IMqE241rYiqJxyMiZ6OW/JmZQ5stwEULTy" crossorigin="anonymous"></script></body>
</html>